Repository: collective/zettwerk.mailtemplates
Catalog: zettwerk/mailtemplates/locales/*/LC_MESSAGES/zettwerk.mailtemplates.po
Languages: de

source: Choose recipients by user or group
de: Empfänger über Benutzer oder Gruppe wählen

source: Content Providers
de: Inhaltsgeneratoren

source: Content Providers provide one or more variables to insert content into messages. This content can differ for each recipient. After selecting one or more content providers for a template you can use the variables they provide in the template.
de: Inhaltsgeneratoren stellen eine oder mehrere Variablen zur Verfügung, welche verwendet werden können, um generierte Inhalte in Nachrichten einzufügen. Diese Inhalte können sich je nach Empfänger unterscheiden. Nach Auswahl eines oder meherer Inhaltsgeneratoren können die von diesen Generatoren zur Verfügung gestellten Variablen im Template verwendet werden.

source: Enter a user id. If this field is given, the group filters are ignored.
de: Geben Sie eine Benutzer ID an. Wenn dieses Feld gesetzt ist, werden die weiteren Gruppen Filter ignoriert.

source: Enter the mail subject
de: Geben Sie den Betreff der E-Mail ein.

source: Extra filters
de: Zusätzliche Filter

source: Group
de: Gruppe

source: Leave empty to choose all portal users.
de: Leer lassen um alle Portal Benutzer auszuwählen.

source: Mail body
de: E-Mail Text

source: Mail body text
de: E-Mail Text

source: Mail subject
de: E-Mail Betreff

source: Not logged on members
de: Nicht angemeldete Mitglieder

source: Object filters
de: Objekt-Filter

source: Password Reset Link (Variables: password_reset_link and expiry_date)
de: Password zurücksetzen Link (Variablen: password_reset_link und expiry_date)

source: Recipients can be choosen by username or groupname. If a username is given, the group filter is ignored. If whether username nor groupname is given, <strong>all existing members</strong> are taken.
de: Empfänger können über Benutzer- oder Gruppennamen gewählt werden. Wenn ein Benutzer übergeben wird, wird der Gruppen Filter ignoriert. Wenn weder ein Benutzer- noch Gruppenname übergeben wird, werden <strong>alle vorhandene Mitglieder</strong> ausgewählt.

source: Rendered mail body
de: Ausgabe des E-Mail Texts

source: Send Emails
de: E-Mails senden

source: Simulate and view receivers
de: Simuliere and zeige Empfänger

source: Subject
de: Betreff

source: Template
de: Vorlage

source: Template id
de: Vorlagen-Id

source: User
de: Benutzer

source: You can use python string substitution syntax to insert dynamic values. Supported variables are: username, fullname, portal_url, portal_name, and additional variables provided by enabled content providers. Example: "Hello %(fullname)s"
de: Sie können Python Stringersetzungssyntax zum Einfügen von dynamischen Werten verwenden. Unterstützte Variablen sind: username, fullname, portal_url, portal_name, sowie zusätzliche von aktivierten Inhaltsgeneratoren zur Verfügung gestellte Variablen. Beispiel: "Hallo %(fullname)s"

source: a unique id for the template
de: Eine eindeutige Id für die Vorlage

source: a unique id for the template. You can use a custom one or use one of the defaults: 'registration', 'password_reset'
de: Eine eindeutige Id für die Vorlage. Sie kann frei vergeben werden, oder aber auch die Standard Vorlagen überschrieben werden: 'registration', 'password_reset'
